#include <stdio.h>

/*

    题目：打印出如下图案（菱形）

   *
  ***
 ******
********
 ******
  ***
   *

    程序分析：先把图形分成两部分来看待，前四行一个规律，后三行一个规律，利用双重for循环，第一层控制行，第二层控制列。

*/

main23()
{
    int i, j, k;
    for (i = 0; i <= 3; i++) //第一层，i=0,1,2,3,4
    {
        for (j = 0; j <= 2 - i; j++)  //第二层,j=0,1
            printf(" ");  //打印空格
        for (k = 0; k <= 2 * i; k++)  //第二层
            printf("*");  //打印符号
        printf("\n");  //换行
    }
    for (i = 0; i <= 2; i++)
    {
        for (j = 0; j <= i; j++)
            printf(" ");
        for (k = 0; k <= 4 - 2 * i; k++)
            printf("*");
        printf("\n");
    }
}